flowchart.dot
digraph "flowchart" {
rankdir=TB;
v0 [shape=point,label="",fixedsize=true,width=0.1,xlabel="channel.of"];
v31 [label="P5_RAREFACTION"];
v0 -> v31 [label="metadata_ch"];

v1 [shape=point,label="",fixedsize=true,width=0.1,xlabel="channel.fromPath"];
v4 [label="P1_IMPORT"];
v1 -> v4 [label="manifest_ch"];

v2 [shape=point,label="",fixedsize=true,width=0.1,xlabel="channel.fromList"];
v34 [label="P6_TAXONOMY"];
v2 -> v34 [label="classifiers_ch"];

v3 [shape=point,label="",fixedsize=true,width=0.1,xlabel="channel.fromList"];
v42 [label="P7_DIVERSITY"];
v3 -> v42 [label="contrast_ch"];

v4 [label="P1_IMPORT"];
v5 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v4 -> v5;

v5 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v8 [label="P2_FILTER"];
v5 -> v8;

v6 [shape=point,label="",fixedsize=true,width=0.1];
v8 [label="P2_FILTER"];
v6 -> v8 [label="forward_primer"];

v7 [shape=point,label="",fixedsize=true,width=0.1];
v8 [label="P2_FILTER"];
v7 -> v8 [label="reverse_primer"];

v8 [label="P2_FILTER"];
v10 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v8 -> v10;

v8 [label="P2_FILTER"];
v9 [shape=point];
v8 -> v9;

v10 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v15 [label="P3_DENOISE"];
v10 -> v15;

v11 [shape=point,label="",fixedsize=true,width=0.1];
v15 [label="P3_DENOISE"];
v11 -> v15 [label="forward_left"];

v12 [shape=point,label="",fixedsize=true,width=0.1];
v15 [label="P3_DENOISE"];
v12 -> v15 [label="forward_right"];

v13 [shape=point,label="",fixedsize=true,width=0.1];
v15 [label="P3_DENOISE"];
v13 -> v15 [label="reverse_left"];

v14 [shape=point,label="",fixedsize=true,width=0.1];
v15 [label="P3_DENOISE"];
v14 -> v15 [label="reverse_right"];

v15 [label="P3_DENOISE"];
v26 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v15 -> v26;

v15 [label="P3_DENOISE"];
v19 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v15 -> v19;

v15 [label="P3_DENOISE"];
v18 [shape=point];
v15 -> v18;

v15 [label="P3_DENOISE"];
v17 [shape=point];
v15 -> v17;

v15 [label="P3_DENOISE"];
v16 [shape=point];
v15 -> v16;

v19 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v20 [label="P4_PHYLOTREE"];
v19 -> v20;

v20 [label="P4_PHYLOTREE"];
v25 [shape=point];
v20 -> v25;

v20 [label="P4_PHYLOTREE"];
v24 [shape=point];
v20 -> v24;

v20 [label="P4_PHYLOTREE"];
v23 [shape=point];
v20 -> v23;

v20 [label="P4_PHYLOTREE"];
v27 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v20 -> v27;

v20 [label="P4_PHYLOTREE"];
v22 [shape=point];
v20 -> v22;

v20 [label="P4_PHYLOTREE"];
v21 [shape=point];
v20 -> v21;

v26 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v31 [label="P5_RAREFACTION"];
v26 -> v31;

v27 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v31 [label="P5_RAREFACTION"];
v27 -> v31;

v28 [shape=point,label="",fixedsize=true,width=0.1];
v31 [label="P5_RAREFACTION"];
v28 -> v31 [label="max_depth"];

v29 [shape=point,label="",fixedsize=true,width=0.1];
v31 [label="P5_RAREFACTION"];
v29 -> v31 [label="steps"];

v30 [shape=point,label="",fixedsize=true,width=0.1];
v31 [label="P5_RAREFACTION"];
v30 -> v31 [label="metrics"];

v31 [label="P5_RAREFACTION"];
v32 [shape=point];
v31 -> v32;

v15 [label="P3_DENOISE"];
v34 [label="P6_TAXONOMY"];
v15 -> v34 [label="reads"];

v15 [label="P3_DENOISE"];
v34 [label="P6_TAXONOMY"];
v15 -> v34 [label="feature_table"];

v0 [shape=point,label="",fixedsize=true,width=0.1,xlabel="channel.of"];
v34 [label="P6_TAXONOMY"];
v0 -> v34 [label="metadata_ch"];

v33 [shape=point,label="",fixedsize=true,width=0.1];
v34 [label="P6_TAXONOMY"];
v33 -> v34 [label="tax_level"];

v34 [label="P6_TAXONOMY"];
v46 [label="P8_ANCOMBC"];
v34 -> v46;

v34 [label="P6_TAXONOMY"];
v39 [shape=point];
v34 -> v39;

v34 [label="P6_TAXONOMY"];
v38 [shape=point];
v34 -> v38;

v34 [label="P6_TAXONOMY"];
v37 [shape=point];
v34 -> v37;

v34 [label="P6_TAXONOMY"];
v36 [shape=point];
v34 -> v36;

v34 [label="P6_TAXONOMY"];
v35 [shape=point];
v34 -> v35;

v20 [label="P4_PHYLOTREE"];
v40 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v20 -> v40;

v40 [shape=circle,label="",fixedsize=true,width=0.1,xlabel="collect"];
v42 [label="P7_DIVERSITY"];
v40 -> v42;

v15 [label="P3_DENOISE"];
v42 [label="P7_DIVERSITY"];
v15 -> v42 [label="feature_table"];

v41 [shape=point,label="",fixedsize=true,width=0.1];
v42 [label="P7_DIVERSITY"];
v41 -> v42 [label="sampling_depth"];

v0 [shape=point,label="",fixedsize=true,width=0.1,xlabel="channel.of"];
v42 [label="P7_DIVERSITY"];
v0 -> v42 [label="metadata_ch"];

v42 [label="P7_DIVERSITY"];
v43 [shape=point];
v42 -> v43;

v15 [label="P3_DENOISE"];
v46 [label="P8_ANCOMBC"];
v15 -> v46 [label="feature_table"];

v0 [shape=point,label="",fixedsize=true,width=0.1,xlabel="channel.of"];
v46 [label="P8_ANCOMBC"];
v0 -> v46 [label="metadata_ch"];

v3 [shape=point,label="",fixedsize=true,width=0.1,xlabel="channel.fromList"];
v46 [label="P8_ANCOMBC"];
v3 -> v46 [label="contrast_ch"];

v44 [shape=point,label="",fixedsize=true,width=0.1];
v46 [label="P8_ANCOMBC"];
v44 -> v46 [label="sig_threshold"];

v45 [shape=point,label="",fixedsize=true,width=0.1];
v46 [label="P8_ANCOMBC"];
v45 -> v46 [label="tax_level"];

v46 [label="P8_ANCOMBC"];
v50 [shape=point];
v46 -> v50;

v46 [label="P8_ANCOMBC"];
v49 [shape=point];
v46 -> v49;

v46 [label="P8_ANCOMBC"];
v48 [shape=point];
v46 -> v48;

v46 [label="P8_ANCOMBC"];
v47 [shape=point];
v46 -> v47;

}
